('max train = ', 1.8537676908827525)
('max test = ', 1.823999229830468)
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 13, 21, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 13, 21, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 13, 21, 64)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 13, 21, 64)   256         activation[0][0]                 
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 7, 11, 64)    0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dropout (Dropout)               (None, 7, 11, 64)    0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 7, 11, 128)   73856       dropout[0][0]                    
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 7, 11, 128)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 7, 11, 128)   512         activation_1[0][0]               
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 4, 6, 128)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 4, 6, 128)    0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 4, 6, 128)    147584      dropout_1[0][0]                  
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 4, 6, 128)    0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 4, 6, 128)    512         activation_2[0][0]               
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 2, 3, 128)    0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 2, 3, 128)    0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 768)          0           dropout_2[0][0]                  
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 2)]          0                                            
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 770)          0           flatten[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           49344       concatenate[0][0]                
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 64)           49344       concatenate[0][0]                
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 64)           0           dense[0][0]                      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 64)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 64)           256         activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64)           256         activation_7[0][0]               
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 64)           0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 64)           0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          8320        dropout_3[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 128)          8320        dropout_7[0][0]                  
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 128)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 128)          0           dense_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128)          512         activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 128)          512         activation_8[0][0]               
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 128)          0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 128)          0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 128)          16512       dropout_4[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 128)          16512       dropout_8[0][0]                  
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 128)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 128)          0           dense_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 128)          512         activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 128)          512         activation_9[0][0]               
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 128)          0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 128)          0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           8256        dropout_5[0][0]                  
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 64)           8256        dropout_9[0][0]                  
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 64)           0           dense_3[0][0]                    
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 64)           0           dense_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 64)           256         activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 64)           256         activation_10[0][0]              
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 64)           0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 64)           0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1)            65          dropout_6[0][0]                  
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 1)            65          dropout_10[0][0]                 
__________________________________________________________________________________________________
x (Activation)                  (None, 1)            0           dense_4[0][0]                    
__________________________________________________________________________________________________
y (Activation)                  (None, 1)            0           dense_9[0][0]                    
==================================================================================================
Total params: 391,426
Trainable params: 389,250
Non-trainable params: 2,176
__________________________________________________________________________________________________
('training time ', 1.4200000000000017)
('inference_time = ', 470.71)
